package com.tbread.util

object ServerMap {
    val servers = mapOf(
        // Elyos (1001-1021)
        1001 to "시엘",     1002 to "네자칸",   1003 to "바이젤",
        1004 to "카이시넬", 1005 to "유스티엘", 1006 to "아리엘",
        1007 to "프레기온", 1008 to "메스람타에다", 1009 to "히타니에",
        1010 to "나니아",   1011 to "타하바타", 1012 to "루터스",
        1013 to "페르노스", 1014 to "다미누",   1015 to "카사카",
        1016 to "바카르마", 1017 to "챈가룽",   1018 to "코치룽",
        1019 to "이슈타르", 1020 to "티아마트", 1021 to "포에타",

        // Asmodian (2001-2021)
        2001 to "이스라펠", 2002 to "지켈",     2003 to "트리니엘",
        2004 to "루미엘",   2005 to "마르쿠탄", 2006 to "아스펠",
        2007 to "에레슈키갈", 2008 to "브리트라", 2009 to "네몬",
        2010 to "하달",     2011 to "루드라",   2012 to "울고른",
        2013 to "무닌",     2014 to "오다르",   2015 to "젠카카",
        2016 to "크로메데", 2017 to "콰이링",   2018 to "바바룽",
        2019 to "파프니르", 2020 to "인드나흐", 2021 to "이스할겐"
    )

    fun getName(id: Int): String = servers[id] ?: ""
}
